app/controllers/api/puzzles_controller.rb

  def index
    room = Room.find(params[:room_id]);
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 24 LIMIT 1