app/controllers/puzzles_controller.rb

  def index
    @room = Room.find(params[:room_id])
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 15 LIMIT 1

  def update
    puzzle = Puzzle.find(params[:id])
    puzzle = puzzle.update(question: puzzles_params[:array])
---
SELECT  `puzzles`.* FROM `puzzles` WHERE `puzzles`.`id` = 12 LIMIT 1
UPDATE `puzzles` SET `question` = '1,3,5,0,0,8,0,0,7,2,6,7,1,5,3,8,9,4,0,0,9,7,6,2,1,0,0,0,9,4,0,0,6,0,5,1,0,0,1,8,0,9,0,7,0,6,0,0,3,0,0,0,4,0,9,0,0,6,2,7,5,0,0,5,1,3,0,0,4,0,2,0,7,0,0,0,0,0,0,0,0', `updated_at` = '2019-06-15 08:23:53' WHERE `puzzles`.`id` = 12