app/controllers/rooms_controller.rb

INSERT INTO `room_users` (`room_id`, `user_id`, `created_at`, `updated_at`) VALUES (25, 1, '2019-06-15 10:19:07', '2019-06-15 10:19:07')
INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('Johnの部屋', '2019-06-15 10:19:07', '2019-06-15 10:19:07')
SELECT  `puzzles`.* FROM `puzzles` WHERE `puzzles`.`id` = 1 LIMIT 1
UPDATE `puzzles` SET `room_id` = 25, `updated_at` = '2019-06-15 10:19:07' WHERE `puzzles`.`id` = 32
---
  def create
    room = current_user.rooms.create(name: current_user.name);
    puzzle = Puzzle.where("room_id is null").sample
    puzzle.room_id = room.id
    puzzle.save