app/controllers/users_controller.rb

  def show
    @rooms = current_user.rooms
    @all_rooms = Room.all - @rooms
---
SELECT `rooms`.* FROM `rooms` INNER JOIN `room_users` ON `rooms`.`id` = `room_users`.`room_id` WHERE `room_users`.`user_id` = 1